{"config": [{"config": {"input_dtype": "float32", "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bS)\u0002N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0090\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [64, 64, 3], "name": "lambda_1", "arguments": {}}, "class_name": "Lambda"}, {"config": {"trainable": true, "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "nb_filter": 32, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_1", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "nb_filter": 32, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_2", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_3", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_4", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_4", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "nb_filter": 128, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_5", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "nb_filter": 128, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_6", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_6", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "init": "glorot_uniform", "output_dim": 512, "W_constraint": null, "b_constraint": null, "name": "dense_1", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "activity_regularizer": null, "input_dim": 2048, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "output_dim": 64, "W_constraint": null, "b_constraint": null, "name": "dense_2", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "activity_regularizer": null, "input_dim": 512, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "output_dim": 16, "W_constraint": null, "b_constraint": null, "name": "dense_3", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "activity_regularizer": null, "input_dim": 64, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "b_constraint": null, "name": "dense_4", "bias": true, "W_regularizer": null, "activity_regularizer": null, "input_dim": 16, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}